class script(object):
    START_TXT = """<b><u>✨ MovixUniverse সার্চ বট ✨</u></b>

<b>ʜᴇʏ {}, {}</b>

<b>🤖 আমি <a href=https://t.me/{}>{}</a>, প্রিমিয়াম ফিচারসহ সবচেয়ে শক্তিশালী একটি অটো ফিল্টার বট।</b>

📌 মুভি বা সিরিজ খুঁজতে নিচের বাটনে ক্লিক করে আমাদের রিকোয়েস্ট গ্রুপে জয়েন করুন 👇
"""

    GSTART_TXT = """<b>✨ MovixUniverse গ্রুপ সার্ভিস ✨</b>

<b>ʜᴇʏ {},</b>

<b>🤖 আমি <a href=https://t.me/{}>{}</a>, প্রিমিয়াম ফিচারসহ সবচেয়ে শক্তিশালী একটি অটো ফিল্টার বট। মুভি পেতে এখানে সঠিক বানানে সার্চ করুন।</b>"""

    HELP_TXT = """<b>
✨ যেভাবে মুভি ও ড্রামা রিকোয়েস্ট করবেন ✨  

1️⃣ প্রথমে সঠিক বানানটি Google এ চেক করে নিন।  
2️⃣ সম্পূর্ণ নামটির সঠিক বানান গ্রুপে মেসেজ করুন।  
3️⃣ নিচের ফরম্যাটগুলো ব্যবহার করুন:  

📌 ওয়েব সিরিজের জন্য:  
➤ সিরিজের নাম + S01 (সিজন ১ এর জন্য S01, ২ এর জন্য S02 লিখবেন)  

📌 হিন্দি ড্রামার জন্য:  
➤ ড্রামার নাম + Hindi  

📌 মুভির জন্য:  
➤ মুভির নাম + মুক্তির সাল (যেমন: Joker 2019)  

🚀 সঠিক ফাইল পেতে এই নিয়মগুলো মেনে চলুন!
</b>"""

    ABOUT_TXT = """<b>╭────[ ᴍʏ ᴅᴇᴛᴀɪʟs ]────⍟
├⍟ বটের নাম : <a href=https://t.me/{}>{}</a>
├⍟ অনার : <a href="https://t.me/mizanur211053">MovixUniverse Admin</a> 
├⍟ লাইব্রেরি : <a href='https://docs.pyrogram.org/'>Pyrogram</a>
├⍟ ল্যাঙ্গুয়েজ : <a href='https://www.python.org/'>Python 3</a> 
├⍟ ডাটাবেজ : <a href='https://www.mongodb.com/'>MongoDB</a> 
├⍟ সার্ভার : <a href='https://render.com/'>Render</a> 
├⍟ বিল্ড স্ট্যাটাস : ᴠ1.4 [ ꜱᴛᴀʙʟᴇ ]
╰───────────────⍟</b>"""

    RESTART_TXT = """
<b>{} বট সফলভাবে রিস্টার্ট হয়েছে!

📅 তারিখ : <code>{}</code>
⏰ সময় : <code>{}</code>
🌐 টাইমজোন : <code>Asia/Dhaka</code>
🛠️ স্ট্যাটাস: <code> v1.4 [ Sᴛᴀʙʟᴇ ]</code>
</b>"""

    CHANNELS = """
<b>⚡ গ্রুপ এবং চ্যানেল ইনফো ⚡  

▫ সব নতুন মুভি ও ওয়েব সিরিজ এখানে পাবেন।
▫ দ্রুততম সার্ভার বট যুক্ত করা হয়েছে।
▫ সম্পূর্ণ ফ্রি এবং ব্যবহার করা সহজ।
▫ ২৪ ঘণ্টা অনলাইন সার্ভিস সচল থাকে।</b>"""

    MULTI_STATUS_TXT = """<b>🗃️ ইউজার ডাটাবেজ 🗃️

» মোট ইউজার - {0}
» মোট গ্রুপ - {1}
» প্রিমিয়াম ইউজার - {2}

📤 ডাটাবেজ ১ 📤

» মোট ফাইল - {3}
» ডিবি স্টোরেজ - {4}
» ক্লাস্টার স্টোরেজ - {5} / 512.00 MB
» ফ্রি স্টোরেজ - {6}

📥 ডাটাবেজ ২ 📥

» মোট ফাইল - {7}
» ডিবি স্টোরেজ - {8}
» ক্লাস্টার স্টোরেজ - {9} / 512.00 MB
» ফ্রি স্টোরেজ - {10}

🤖 বটের বিস্তারিত 🤖

» আপটাইম - {11}
» র‍্যাম ব্যবহার - {12}%
» সিপিইউ ব্যবহার - {13}%

» সর্বমোট ফাইল - {14}</b>"""

    STATUS_TXT = """<b>🗃️ ইউজার ডাটাবেজ 🗃️

» মোট ইউজার - {0}
» মোট গ্রুপ - {1}
» প্রিমিয়াম ইউজার - {2}

📤 ফাইল ডাটাবেজ 📤

» মোট ফাইল - {3}
» ডিবি স্টোরেজ - {4}
» ক্লাস্টার স্টোরেজ - {5} / 512.00 MB
» ফ্রি স্টোরেজ - {6}

🤖 বটের বিস্তারিত 🤖

» আপটাইম - {7}
» র‍্যাম ব্যবহার - {8}%
» সিপিইউ ব্যবহার - {9}%</b>"""

    LOG_TEXT_G = """#NewGroup
গ্রুপের নাম = {}
আইডি = <code>{}</code>
মোট মেম্বার = <code>{}</code>
যুক্ত করেছে - {}"""

    LOG_TEXT_P = """#NewUser
আইডি - <code>{}</code>
নাম - {}"""

    NT_ADMIN_ALRT_TXT = """‼️ দুঃখিত, আপনি এই গ্রুপের অ্যাডমিন নন ‼️"""
    NT_ALRT_TXT = """এটি আপনার জন্য নয়!"""
    ALRT_TXT = """হ্যালো {},\nএটি আপনার মুভি রিকোয়েস্ট নয়,\nঅনুগ্রহ করে নিজের মুভি আলাদাভাবে সার্চ করুন..."""
    OLD_ALRT_TXT = """হে {},\nআপনি অনেক আগের একটি মেসেজ ব্যবহার করছেন,\nঅনুগ্রহ করে নতুন করে আবার সার্চ করুন।"""

    PRE_STREAM = """🔒 এই ফিচারটি শুধুমাত্র 🏅 প্রিমিয়াম ইউজারদের জন্য\n✨ বিজ্ঞাপন ছাড়া ডিরেক্ট ফাইল ও প্রিমিয়াম সুবিধা পেতে\n💳 দয়া করে প্রিমিয়াম সাবস্ক্রিপশন কিনুন।"""
    PRE_STREAM_ALERT = """⚠️ প্রিমিয়াম কনটেন্ট ❗\n🔓 এটি দেখতে আপনার অ্যাকাউন্টটি প্রিমিয়ামে আপগ্রেড করুন।"""

    CUDNT_FND = SPELLING_ERROR_TXT = """<b>‼️ বানানে ভুল হয়েছে ভাই!</b>  
<b>😊 কোনো সমস্যা নেই — নিচে দেওয়া অপশন থেকে সঠিক মুভিটি বেছে নিন 👇</b>

<blockquote>👇 নিচে দেওয়া তালিকা থেকে সঠিক বানানের মুভিটি সিলেক্ট করুন</blockquote>"""

    DEL_MSG = """⚠️ এই মুভি ফাইল/ভিডিওটি কপিরাইট ইস্যুর কারণে <b><u><code>{}</code></u></b> এর মধ্যে ডিলিট হয়ে যাবে।\n\n<blockquote expandable><b><i>ডিলিট হওয়ার আগে ফাইলটি অন্য কোথাও ফরোয়ার্ড (Forward) করে রাখুন অথবা ডাউনলোড করা শুরু করুন।</i></b></blockquote>"""

    I_CUDNT = """<b>দুঃখিত, আপনার রিকোয়েস্ট করা '{}' মুভিটি খুঁজে পাওয়া যায়নি 😕\n\nদয়া করে Google থেকে সঠিক বানানটি চেক করে আবার চেষ্টা করুন 😃\n\n📝 মুভি রিকোয়েস্ট ফরম্যাট 👇\n⚜️ উদাহরণ : Jawan অথবা Jawan 2023 \n\n📝 সিরিজ রিকোয়েস্ট ফরম্যাট 👇\n⚜️ উদাহরণ : Loki S01\n🚯 মেসেজে কোনো প্রকার স্পেশাল ক্যারেক্টার ➠ ':(!,./) ব্যবহার করবেন না।</b>"""
    I_CUD_NT = """<b>আমি {} সম্পর্কিত কোনো মুভি খুঁজে পাইনি।\n\nখুঁজে না পাওয়ার সম্ভাব্য কারণসমূহ :\n1) ওটিটি (OTT) বা ব্লু-রে প্রিন্ট এখনও রিলিজ হয়নি।\n2) মুভির নামের সাথে মুক্তির সাল উল্লেখ করেননি।\n3) মুভিটি আমাদের ডাটাবেজে এখনও যুক্ত করা হয়নি।</b>"""

    MVE_NT_FND = NOT_FOUND_TXT = """<b>😌 এই মুভিটি আমাদের ডাটাবেজে খুঁজে পাওয়া যায়নি।</b>\n<blockquote>😌 আপনার দেওয়া বানানে কোনো ভুল থাকতে পারে। দয়া করে সঠিক বানান দিয়ে আবার সার্চ করুন।</blockquote>"""

    ALREADY_AVAILABLE_TXT = """<b>হে {},\nআপনার রিকোয়েস্ট করা ফাইলটি অলরেডি আমাদের ডাটাবেজে আছে ✅\n\n<blockquote>📂 মোট ফাইল : {}\n🔍 আপনার সার্চ : <code>{}</code></blockquote>\n\n‼️ এটি একটি সাপোর্ট গ্রুপ, তাই সরাসরি এখান থেকে ফাইল দেওয়া সম্ভব নয়...\n\n📝 ফাইল পেতে এখানে সার্চ করুন : 👇</b>"""
    MAINTENANCE_TXT = """<b>🛑 বট আপডেট চলছে (Maintenance) 🛑</b>\n<b>হে {}, আপনাদের আরও ভালো সার্ভিস দিতে আমাদের সিস্টেম আপডেট করা হচ্ছে। সাময়িকভাবে বট বন্ধ রয়েছে। দয়া করে কিছু সময় পর আবার চেষ্টা করুন। 😊</b>"""
    PM_SEARCH_DISABLED_TXT = """<b>🙋 হে {} 😍,\n\nআপনি সরাসরি বটের ইনবক্সে মুভি সার্চ করতে পারবেন না। মুভি পেতে নিচের Request Group বাটনে ক্লিক করে আমাদের অফিশিয়াল মুভি গ্রুপে জয়েন করুন এবং সেখানে সার্চ করুন। ধন্যবাদ।\n<blockquote>নিরাপত্তা জনিত কারণে বটের ইনবক্সে সরাসরি সার্চ অপশন বন্ধ রাখা হয়েছে। মুভি পেতে অবশ্যই আমাদের গ্রুপে জয়েন করতে হবে।</blockquote></b>"""

    PM_LOG_TXT = """<b>#𝐏𝐌_𝐌𝐒𝐆\n👤 নাম : {}\n🆔 আইডি : <code>{}</code>\n💬 মেসেজ : {}</b>"""
    LINK_EXPIRED_TXT = """<b>‼️ লিংকটির মেয়াদ শেষ হয়ে গেছে, দয়া করে আবার চেষ্টা করুন...</b>"""
    REFER_TXT = """<b>হেই, এটি আপনার রেফারেল লিংক:\n<code>https://t.me/{}?start=reff_{}</code>\n<blockquote>আপনার বন্ধুদের এই লিংকের মাধ্যমে বটে ইনভাইট করুন। প্রতিবার কেউ জয়েন করলে আপনি ১০ পয়েন্ট পাবেন। ১০০ পয়েন্ট হলে পাবেন ১ মাসের জন্য ফ্রি প্রিমিয়াম সাবস্ক্রিপশন!</blockquote></b>"""
    REFER_SELF_ALRT = """<b>হে বন্ধু, আপনি নিজেকে নিজে রেফার করতে পারবেন না 🤣!\n<blockquote>বন্ধুদের সাথে লিংক শেয়ার করে পয়েন্ট জমান এবং ফ্রি প্রিমিয়াম লুফে নিন।</blockquote></b>"""
    REFER_ALREADY_ALRT = """<b>আপনি ইতিমধ্যেই এই লিংকের মাধ্যমে আমন্ত্রিত হয়েছেন ❗</b>"""
    REFER_ALREADY_JOINED_ALRT = """<b>‼️ আপনি অলরেডি এই বটে জয়েন আছেন অথবা আমন্ত্রিত হয়েছেন।</b>"""
    REFER_CONGRATS_ALRT = """<b>🎉 অভিনন্দন! আপনার আমন্ত্রণে সফলভাবে একজন যুক্ত হওয়ায় আপনি ১০ রেফারেল পয়েন্ট পেয়েছেন ☞ {}!</b>"""
    REFER_INVITED_ALRT = """<b>আপনি সফলভাবে {} এর আমন্ত্রণে যুক্ত হয়েছেন!</b>"""

    FORCESUB_TXT = """<b>👋 হ্যালো {}\n\n🛑 বট ব্যবহার করতে হলে আপনাকে অবশ্যই আমাদের অফিশিয়াল চ্যানেলে জয়েন থাকতে হবে।\n\n<blockquote>👉 নিচের চ্যানেল বাটনে ক্লিক করে জয়েন করুন এবং আবার ট্রাই করুন।</blockquote></b>"""
    BOT_ADD_TXT = """<b>আমাকে {} গ্রুপে যুক্ত করার জন্য আপনাকে অনেক ধন্যবাদ ❣️\n<blockquote>বট ব্যবহার নিয়ে কোনো প্রশ্ন বা সমস্যা থাকলে আমাদের সাপোর্ট গ্রুপে যোগাযোগ করুন।</blockquote></b>"""
    CHAT_RESTRICTED_TXT = """<b>এই চ্যাটে বট ব্যবহার নিষিদ্ধ করা হয়েছে 🐞\n<blockquote>অ্যাডমিন প্যানেল থেকে এই গ্রুপে বটের কার্যকারিতা ব্লক করা হয়েছে। বিস্তারিত জানতে সাপোর্টে কথা বলুন।</blockquote></b>"""
    LEAVE_CHAT_TXT = """<b>হ্যালো বন্ধুরা, বিদায়!\n<blockquote>অ্যাডমিনের নির্দেশনাক্রমে আমাকে এই গ্রুপটি লিভ নিতে হচ্ছে। পরবর্তীতে আবার যুক্ত করতে চাইলে অনারের সাথে যোগাযোগ করুন।</blockquote></b>"""
    SEARCHING_TXT = """<b><i> '{}' মুভিটি খোঁজা হচ্ছে 🔎 একটু অপেক্ষা করুন...</i></b>"""
    TOP_ALRT_MSG = """ডাটাবেজ থেকে আপনার ফাইলটি খোঁজা হচ্ছে..."""
    MELCOW_ENG = """<b>👋 হে {},\n\n🍁 স্বাগতম আপনাকে\n🌟 {} চ্যানেলে \n\n🔍 এখানে আপনি শুধু সঠিক বানানটি লিখে মেসেজ করলেই আপনার পছন্দের মুভি বা ওয়েব সিরিজ পেয়ে যাবেন 🔎\n\n⚠️ ডাউনলোডে কোনো সমস্যা হলে নিচের সাপোর্ট গ্রুপে জানান 👇</b>"""
    DISCLAIMER_TXT = """<b>এটি একটি ওপেন সোর্স প্রজেক্ট। ইন্টারনেটে এবং টেলিগ্রামে ইতিমধ্যে আপলোড থাকা ফাইলগুলো সহজে খুঁজে পাওয়ার সুবিধার্থে এই বটটি একটি ইন্ডেক্স বা সার্চ ইঞ্জিন হিসেবে কাজ করে। আমরা কপিরাইট আইনের প্রতি শ্রদ্ধাশীল। কোনো ফাইল নিয়ে আপত্তি থাকলে অনারের সাথে যোগাযোগ করুন, দ্রুত তা অপসারণ করা হবে। অনুমতি ছাড়া কনটেন্ট ডাউনলোড বা স্ট্রিম করা সম্পূর্ণ আপনার নিজস্ব দায়িত্ব।</b>"""
    DREAMXBOTZ_DONATION = DONATE_TXT = """<b>👋 হে {},\n\n<blockquote>💖 ডেভলপার এবং সার্ভার খরচ চালাতে আমাদের সাপোর্ট করুন</blockquote>\n<b>বটের সার্ভিস ২৪ ঘণ্টা চালু রাখতে, নতুন নতুন ফিচার যুক্ত করতে এবং হাই কোয়ালিটি মুভি নিরবচ্ছিন্নভাবে আপলোড দিতে আমাদের প্রচুর সার্ভার ফি দিতে হয়। আপনার যেকোনো ছোট অনুদান আমাদের সাহায্য করবে। 😊</b>\n\n<blockquote>🎉 আপনার সুবিধাজনক পেমেন্ট মেথড সিলেক্ট করুন 👇</blockquote>\n➤ 📷 QR কোড → <a href='{}'>এখানে ক্লিক করে স্ক্যান করুন</a>  \n➤ 💸 UPI আইডি → <code>{}</code>\n\n‼️ পেমেন্ট করার পর অবশ্যই স্ক্রিনশট ইনবক্সে পাঠাবেন।</b>"""

    SINFO = """⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯\nওয়েব সিরিজ রিকোয়েস্ট ফরম্যাট\n⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯\nGoogle এ যান ➠ সঠিক নামটি কপি করুন ➠ গ্রুপে এসে পেস্ট করুন\n\nউদাহরণ : Loki S01E01\n🚯 কোনো প্রকার স্পেশাল ক্যারেক্টার ( যেমন: :(!,./) ) ব্যবহার করবেন না।"""
    NORSLTS = """#NoResults\nআইডি : <code>{}</code>\nনাম : {}\nসার্চ টেক্সট : <b>{}</b>"""
    
    CAPTION = """<b><a href="https://t.me/mizanur211053">{file_name}</a></b>\n\n<b>⚜️ Powered By : <a href="https://t.me/mizanur211053">[ ᴍᴏᴠɪxᴜɴɪᴠᴇʀsᴇ ]</a></b>"""

    MOVIE_UPDATE_NOTIFY_TXT = """</b><a href={poster_url}>📥</a><a href={imdb_url}>নতুন {tag} যুক্ত করা হয়েছে</a></b>\n\n<blockquote>✨ নাম : <code>{filename} {year}</code>\n\n🎭 ধরন : <b>{genres}</b>\n📺 ওটিটি : <b>{ott}</b>\n🎞️ কোয়ালিটি : <b>{quality}</b>\n🎧 অডিও : <b>{language}</b>\n🔥 রেটিং : <b>{rating}</b>\n{episodes}\n</blockquote>\n\n🔍 <b>ডাউনলোড করতে সার্চ করুন →</b> {search_link}"""
    IMDB_TEMPLATE_TXT = """<b><a href={url}>{title} (<a href={url}/releaseinfo>{year}</a>)\n\nরেটিং : <a href={url}/ratings>{rating}</a>\nধরন : {genres}\nভাষা : {languages}\n\nফাইল রেডি হতে সময় লাগবে : {remaining_seconds} <i>সেকেন্ড</i>⚡️\n<b>রিকোয়েস্ট করেছেন : {message.from_user.mention}</b>"""

    # আপনার ব্র্যান্ড MOVIXUNIVERSE লোগো ডিজাইন
    LOGO = r"""
███╗░░███╗░█████╗░██╗░░██╗██╗██╗░░██╗██╗░░██╗███╗░░██╗██╗██╗░░░██╗███████╗██████╗░░██████╗███████╗
████╗░████║██╔══██╗██║░░██║██║╚██╗██╔╝██║░░██║████╗░██║██║██║░░░██║██╔════╝██╔══██╗██╔════╝██╔════╝
██╔████╔██║██║░░██║╚██╗██╔╝██║░╚███╔╝░██║░░██║██╔██╗██║██║██║░░░██║█████╗░░██████╔╝╚█████╗░█████╗░░
██║╚██╔╝██║██║░░██║░╚███╔╝░██║░██╔██╗░██║░░██║██║╚████║██║╚██╗░██╔╝██╔══╝░░██╔══██╗░╚═══██╗██╔══╝░░
██║░╚═╝░██║╚█████╔╝░░╚██╔╝░██║██╔╝╚██╗╚█████╔╝██║░╚███║██║░╚████╔╝░███████╗██║░░██║██████╔╝███████╗
╚═╝░░░░░╚═╝░╚════╝░░░░╚═╝░░╚═╝╚═╝░░╚═╝░╚════╝░╚═╝░░╚══╝╚═╝░░╚═══╝░░╚══════╝╚═╝░░╚═╝╚═════╝░╚══════╝

                         <b>𝙼𝙾𝚅𝙸𝚇𝚄𝙽𝙸𝚅𝙴𝚁𝚂𝙴 𝙱𝙾𝚃 𝙸𝚂 𝙻𝙸𝚅𝙴....</b>
    """

    PAGE_TXT = """✨ MovixUniverse প্রিমিয়াম মেম্বারশিপ"""
    PURCHASE_TXT = """আপনার পেমেন্ট মেথড সিলেক্ট করুন।"""

    PREMIUM_TEXT = """<blockquote>🎖️ <b>প্রিমিয়াম প্ল্যানসমূহ</b></blockquote>

◉ ০৭ দিন - ১০ টাকা
◉ ১৫ দিন - ২০ টাকা
◉ ৩০ দিন - ৪০ টাকা
◉ ৪৫ দিন - ৫৫ টাকা
◉ ৬০ দিন - ৭৫ টাকা

•─────•─────────•─────•
🏷️ প্রিমিয়াম মেম্বারশিপের পর কোনো লিংক ওপেন করতে হবে না, সরাসরি বটের ইনবক্সে হাই স্পিড ফাইল পাবেন।

‼️ পেমেন্ট করার পর অবশ্যই স্ক্রিনশট পাঠাবেন।
‼️ স্ক্রিনশট ভেরিফাই করে আপনাকে প্রিমিয়াম লিস্টে যুক্ত করতে ৫-১০ মিনিট সময় লাগতে পারে।"""

    PREMIUM_STAR_TEXT = """<b><blockquote>পেমেন্ট মেথড: Telegram Stars ⭐</blockquote>

এখন আপনি টেলিগ্রাম স্টারের (Stars) মাধ্যমেও আমাদের প্রিমিয়াম মেম্বারশিপ কিনতে পারবেন।  

কোনো সমস্যা হলে স্ক্রিনশট নিয়ে আমাদের গ্রুপে জানান - @mizanur211053

নিচের তালিকা থেকে আপনার পছন্দের প্ল্যানটি সিলেক্ট করুন 👇।</b>"""

    PREMIUM_UPI_TEXT = """<b><blockquote>পেমেন্ট মেথড: UPI / মোবাইল ব্যাংকিং</blockquote>

আপনি UPI, নেট ব্যাংকিং বা মোবাইল ব্যাংকিংয়ের মাধ্যমে প্রিমিয়াম কিনতে পারেন।

💳 UPI আইডি - <code>{}</code>

💢 পেমেন্ট শেষ করে অবশ্যই স্ক্রিনশট ইনবক্সে শেয়ার করবেন।

‼️ স্ক্রিনশট পাঠানোর পর অনুগ্রহ করে আমাদের টিমকে কিছুটা সময় দিন আপনার অ্যাকাউন্টটি প্রিমিয়াম করার জন্য।</b>"""

    PREMIUM_END_TEXT = """<b>হে {},</b>\n\n<b>আপনার প্রিমিয়াম মেম্বারশিপের মেয়াদ শেষ হয়ে গেছে।</b>  \n<b>আমাদের সার্ভিসটি ব্যবহার করার জন্য আপনাকে ধন্যবাদ 😊</b>  \n<b>আমাদের অন্যান্য প্ল্যানগুলো দেখতে আবার /plan কমান্ডটি ব্যবহার করুন।</b>\n\n<blockquote>আপনার অ্যাকাউন্টটি এখন ফ্রি প্ল্যানে স্থানান্তরিত হয়েছে। পুনরায় প্রিমিয়াম সুবিধা সচল করতে <b>/plan</b> এ ক্লিক করুন।</blockquote>"""

    BPREMIUM_TXT = """<blockquote>🎁 <b>প্রিমিয়াম মেম্বারশিপের সুবিধাসমূহ :</b></blockquote>\n\n○ কোনো প্রকার ভেরিফিকেশন বা ক্যাপচা লিংক ওপেন করতে হবে না।\n○ বটের ইনবক্সে সরাসরি মেইন ফাইল দেওয়া হবে।\n○ সম্পূর্ণ বিজ্ঞাপন মুক্ত অভিজ্ঞতা।\n○ হাই-স্পিড ডিরেক্ট ডাউনলোড লিংক।\n○ আনলিমিটেড মুভি ও ওয়েব সিরিজ ডাউনলোডের সুবিধা।\n○ যেকোনো সমস্যায় ২৪ ঘণ্টা অ্যাডমিন সাপোর্ট পাবেন।\n○ রিকোয়েস্ট করা মুভি ১ ঘণ্টার মধ্যে ডাটাবেজে যুক্ত করা হবে (উপলব্ধ থাকলে)।\n\n• আপনি বন্ধুদের রেফার করেও পয়েন্ট জমিয়ে ফ্রি প্রিমিয়াম পেতে পারেন অথবা সরাসরি কিনতে পারেন।\n\n•─────•─────────•─────•\n◉ আপনার বর্তমান প্ল্যান চেক করতে লিখুন : /myplan\n\n‼️ স্ক্রিনশট পাঠানোর পর মেম্বারশিপ যুক্ত হতে কিছুটা সময় লাগতে পারে, দয়া করে অপেক্ষা করবেন।"""  

    PREPLANS_TXT = PREMIUM_TXT

    FREE_TXT = """<b>👋 হে {},\n\n🎉 <u>ফ্রি ট্রায়াল অফার</u> 🎉\n❗ মেয়াদের সময় মাত্র ৫ মিনিট\n \n○ কোনো প্রকার লিংক ওপেন করতে হবে না\n○ মাল্টি-প্লেয়ার স্ট্রিমিং লিংক পাবেন\n○ কোনো বিজ্ঞাপন থাকবে না\n\n👨‍💻 ফ্রি ট্রায়ালটি অ্যাক্টিভেট করতে <a href='https://t.me/mizanur211053'>অনাল/অ্যাডমিনের</a> সাথে যোগাযোগ করুন।\n\n➛ আমাদের সব প্ল্যান একসাথে দেখতে ব্যবহার করুন: /plan\n➛ আপনার একটিভ প্ল্যান দেখতে লিখুন : /myplan</b>"""

    UPI_TXT = """<b>👋 হে {},\n\nআপনার পছন্দসই প্ল্যান অনুযায়ী টাকা পাঠিয়ে প্রিমিয়াম মেম্বারশিপ উপভোগ করুন!\n\n💵 UPI আইডি - <code>{}</code>\n\n‼️ পেমেন্ট সম্পন্ন হওয়ার পর অবশ্যই স্ক্রিনশট পাঠাবেন।</b>"""

    QR_TXT = """<b>👋 হে {},\n\nআপনার পছন্দসই প্ল্যান অনুযায়ী কিউআর কোড স্ক্যান করে পে করুন এবং প্রিমিয়াম মেম্বারশিপ উপভোগ করুন!\n\n📸 QR কোড - <a href='{}'>এখানে ক্লিক করে স্ক্যান করুন</a>\n\n‼️ পেমেন্ট সম্পন্ন হওয়ার পর অবশ্যই স্ক্রিনশট পাঠাবেন।</b>"""

    SOURCE_TXT = """<b>Source Code : 👇 </b>\n\nএটি একটি ওপেন-সোর্স প্রজেক্ট। আপনি এটি ফ্রিতে ব্যবহার করতে পারেন, তবে এই সোর্স কোডটি বিক্রি করা সম্পূর্ণ নিষিদ্ধ।\n\nসোর্স কোড লিংক ◉› : <a href="https://github.com/DreamXBotz/Auto_Filter_Bot.git">[ MovixUniverse Source ]</a>"""

    SETTING_TXT = """<u><b>সেটিংস গাইডলাইন</b></u> :\n- সেটিংস এই বটের একটি অত্যন্ত গুরুত্বপূর্ণ ফিচার।\n- এর মাধ্যমে আপনি আপনার মুভি গ্রুপটিকে নিজের মতো করে সাজাতে পারবেন।\n\n<u><b>উপলব্ধ কমান্ডসমূহ</b></u> :\n• /settings - আপনার গ্রুপের সমস্ত সেটিংস পরিবর্তন করুন।\n• /set_shortner - আপনার ১ম লিংক শর্টনার সেট করুন।\n• /set_shortner_2 - আপনার ২য় লিংক শর্টনার সেট করুন。\n• /set_shortner_3 - আপনার ৩য় লিংক শর্টনার সেট করুন。\n• /set_tutorial - ১ম টিউটোরিয়াল ভিডিও লিংক সেট করুন।\n• /set_tutorial_2 - ২য় টিউটোরিয়াল ভিডিও লিংক সেট করুন。\n• /set_tutorial_3 - ৩য় টিউটোরিয়াল ভিডিও লিংক সেট করুন。\n• /set_time - ১ম ভেরিফিকেশনের সময়সীমা নির্ধারণ করুন।\n• /set_time_2 - ২য় ভেরিফিকেশনের সময়সীমা নির্ধারণ করুন。\n• /set_log_channel - ভেরিফিকেশন লগ চ্যানেল সেট করুন।\n• /set_fsub - কাস্টম ফোর্স সাব চ্যানেল যুক্ত করুন।\n• /remove_fsub - ফোর্স সাব চ্যানেল রিমুভ করুন।\n• /reset_group - গ্রুপের সমস্ত সেটিংস রিসেট করুন।\n• /details - আপনার গ্রুপের বর্তমান সেটিংসের বিস্তারিত দেখুন।"""
    
    VERIFICATION_TEXT = """<b><i>👋 হে {},\n\n📌 আপনি আজকে এখনও ভেরিফিকেশন সম্পন্ন করেননি। দয়া করে নিচের 'Verify' বাটনে ক্লিক করুন এবং পরবর্তী ভেরিফিকেশন সময় পর্যন্ত আনলিমিটেড মুভি ডাউনলোড করুন।\n\n#ধাপ:- 1/3 ✓\n\n💡 আপনি যদি কোনো ঝামেলা ছাড়া সরাসরি ফাইল পেতে চান, তবে আমাদের প্রিমিয়াম মেম্বারশিপ নিতে পারেন (কোনো ভেরিফিকেশন লাগবে না)।</i></b>"""
    
    VERIFY_COMPLETE_TEXT = """<b><i>👋 হে {,\n\nআপনি সফলভাবে ১ম ভেরিফিকেশন সম্পন্ন করেছেন ✓\n\nএখন পরবর্তী ভেরিফিকেশনের আগ পর্যন্ত আপনি আনলিমিটেড মুভি পাবেন।</i></b>"""

    SECOND_VERIFICATION_TEXT = """<b><i>👋 হে {,\n\n📌 আপনার ভেরিফিকেশনের মেয়াদ শেষ। দয়া করে নিচের ভেরিফাই লিংকে ক্লিক করে আপনার অ্যাকাউন্টটি ভেরিফাই করে নিন।\n\n#ধাপ:- 2/3 ✓\n\n💡 কোনো প্রকার লিংক ওপেন ছাড়া ডিরেক্ট ফাইল পেতে প্রিমিয়াম প্ল্যান চেক করুন।</i></b>"""

    SECOND_VERIFY_COMPLETE_TEXT = """<b><i>👋 হে {,\n\nআপনি সফলভাবে ২য় ভেরিফিকেশন সম্পন্ন করেছেন ✓\n\nএখন পরবর্তী ভেরিফিকেশনের আগ পর্যন্ত আনলিমিটেড ফাইল ডাউনলোড করতে পারবেন।</i></b>"""

    THIRDT_VERIFICATION_TEXT = """<b><i>👋 হে {,\n\n📌 এটি আপনার শেষ ভেরিফিকেশন ধাপ। নিচের লিংকে ক্লিক করে ভেরিফাই করুন এবং আগামী ২৪ ঘণ্টার জন্য সম্পূর্ণ আনলিমিটেড এক্সেস পান।</u>\n\n#ধাপ:- 3/3 ✓\n\n💡 কোনো প্রকার ভেরিফিকেশন ছাড়া লাইফটাইম বা মান্থলি ডিরেক্ট ফাইল পেতে প্রিমিয়াম মেম্বারশিপ নিন।</i></b>"""

    THIRDT_VERIFY_COMPLETE_TEXT= """<b><i>👋 হে {,\n\nঅভিনন্দন! আপনি ৩য় ও শেষ ভেরিফিকেশন ধাপটি সফলভাবে সম্পন্ন করেছেন ✓\n\nআগামী ১ দিন (২৪ ঘণ্টা) আপনার কোনো লিংক ওপেন করতে হবে না।</i></b>"""

    VERIFIED_LOG_TEXT = """ইউজার ভেরিফিকেশন সফল হয়েছে ✓\n\n👤 নাম:- {} [ <code>{}</code> ]\n📆 তারিখ:- <code>{} </code>\n\n#Verification_{}_Completed"""

    ADMIN_CMD = """হে 👋,\n\n📚 এখানে বটের সমস্ত অ্যাডমিন কমান্ডের তালিকা দেওয়া হলো ⇊\n\n• /start - <code>বট সচল করতে।</code>\n• /stats - <code>মোট ইউজার এবং চ্যাট ডাটা দেখতে।</code>\n• /del_msg - <code>ফাইল ডিলিট নোটিফিকেশন অন/অফ করতে।</code>\n• /movie_update - <code>মুভি আপডেট মেসেজ সেটিংস।</code> \n• /pm_search - <code>ইনবক্স সার্চ অন বা অফ করতে।</code>\n• /verify - <code>গ্রুপে লিংক ভেরিফিকেশন অন/অফ করতে।</code>\n• /logs - <code>বটের সাম্প্রতিক এরর বা বাগ দেখতে।</code>\n• /delete - <code>ডাটাবেজ থেকে নির্দিষ্ট ফাইল মুছতে।</code>\n• /users - <code>বটের মোট ইউজারের লিস্ট ও আইডি দেখতে।</code>\n• /chats - <code>বট কানেক্টেড গ্রুপের লিস্ট দেখতে।</code>\n• /leave  - <code>কোনো গ্রুপ থেকে বট লিভ নেওয়াতে।</code>\n• /disable  - <code>কোনো চ্যাট সাময়িক বন্ধ করতে।</code>\n• /ban  - <code>কোনো ইউজারকে বট থেকে ব্যান করতে।</code>\n• /unban  - <code>ব্যান থাকা ইউজারকে আনব্যান করতে।</code>\n• /broadcast - <code>সব ইউজারের ইনবক্সে মেসেজ পাঠাতে।</code>\n• /grp_broadcast - <code>সব কানেক্টেড গ্রুপে নোটিশ পাঠাতে।</code>\n• /deletefiles - <code>ক্যামপ্রিন্ট বা নরমাল প্রিন্টের ফাইল ডাটাবেজ থেকে ডিলিট করতে।</code>\n• /send - <code>নির্দিষ্ট কোনো ইউজারকে বটের মাধ্যমে মেসেজ দিতে।</code>\n• /add_premium - <code>যেকোনো ইউজারকে প্রিমিয়াম লিস্টে যুক্ত করতে।</code>\n• /remove_premium - <code>প্রিমিয়াম লিস্ট থেকে ইউজারকে বাদ দিতে।</code>\n• /premium_users - <code>প্রিমিয়াম ইউজারদের তালিকা দেখতে।</code>\n• /get_premium - <code>নির্দিষ্ট প্রিমিয়াম ইউজারের মেয়াদ চেক করতে।</code>\n• /restart - <code>বটের সার্ভার রিস্টার্ট দিতে।</code>\n• /maintenance - <code>বটের মেইনটেন্যান্স মোড অন/অফ করতে।</code>"""

    GROUP_CMD = """হে 👋,\n📚 গ্রুপ কাস্টমাইজ করার জন্য প্রয়োজনীয় কমান্ড লিস্ট ⇊\n\n• /settings - আপনার গ্রুপের সেটিংস ওপেন করুন।\n• /set_shortner - ১ম লিংক শর্টনার যুক্ত করুন।\n• /set_shortner_2 - ২য় লিংক শর্টনার যুক্ত করুন。\n• /set_shortner_3 - ৩য় লিংক শর্টনার যুক্ত করুন。\n• /set_tutorial - ১ম হাউ-টু-ডাউনলোড ভিডিও লিংক।\n• /set_tutorial_2 - ২য় হাউ-টু-ডাউনলোড ভিডিও লিংক。\n• /set_tutorial_3 - ৩য় হাউ-টু-ডাউনলোড ভিডিও লিংক。\n• /set_time - ১ম ভেরিফিকেশনের গ্যাপ টাইম সেট করুন।\n• /set_time_2 - ২য় ভেরিফিকেশনের গ্যাপ টাইম সেট করুন。\n• /set_log_channel - ভেরিফিকেশন লগ চ্যানেল আইডি সেট করুন।\n• /set_fsub - কাস্টম ফোর্স সাবস্ক্রিপশন চ্যানেল লিংক।\n• /remove_fsub - ফোর্স সাবস্ক্রিপশন চ্যানেল রিমুভ করুন।\n• /reset_group - গ্রুপের সমস্ত সেটিংস ডিফল্ট করুন।\n• /details - গ্রুপের বর্তমান কনফিগারেশন চেক করুন।"""
